<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Preface" data-toc-modified-id="Preface-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Preface</a></span><ul class="toc-item"><li><span><a href="#Description" data-toc-modified-id="Description-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Description</a></span></li><li><span><a href="#Imports" data-toc-modified-id="Imports-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Imports</a></span></li><li><span><a href="#Get-the-database-config" data-toc-modified-id="Get-the-database-config-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Get the database config</a></span></li><li><span><a href="#Load-sql-magic" data-toc-modified-id="Load-sql-magic-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Load sql magic</a></span></li><li><span><a href="#Get-names-of-all-tables" data-toc-modified-id="Get-names-of-all-tables-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Get names of all tables</a></span></li><li><span><a href="#Connect-the-mysql-server" data-toc-modified-id="Connect-the-mysql-server-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Connect the mysql server</a></span></li><li><span><a href="#Avoid-1055-error" data-toc-modified-id="Avoid-1055-error-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Avoid 1055 error</a></span></li></ul></li><li><span><a href="#CASE-Statement" data-toc-modified-id="CASE-Statement-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>CASE Statement</a></span><ul class="toc-item"><li><span><a href="#Exercise-1:" data-toc-modified-id="Exercise-1:-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Exercise 1:</a></span></li><li><span><a href="#Exercise-2:" data-toc-modified-id="Exercise-2:-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Exercise 2:</a></span></li><li><span><a href="#Exercie-3:" data-toc-modified-id="Exercie-3:-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Exercie 3:</a></span></li></ul></li></ul></div>

# Preface

## Description
**Notes**  
- Mysql is case insensitive. eg `like('m%')` and `like('M%')` are same.


Entity Relation (ER) Diagram:

![](pdf/employees_db.png)

## Imports

In [1]:
import numpy as np
import pandas as pd
import os
import json

## Get the database config

In [2]:
ifile = os.path.expanduser('~') + "/.mysql_conf.json"
with open(ifile) as fo:
    data = json.load(fo)
    
pw = data['password']

## Load sql magic

In [3]:
%load_ext sql

In [4]:
%sql mysql+mysqlconnector://bhishan:$pw@localhost/employees

'Connected: bhishan@employees'

## Get names of all tables

In [5]:
%%sql
SELECT table_name FROM information_schema.tables
WHERE table_schema = 'employees';

 * mysql+mysqlconnector://bhishan:***@localhost/employees
12 rows affected.

[('current_dept_emp',),
 ('departments',),
 ('departments_dup',),
 ('dept_emp',),
 ('dept_emp_latest_date',),
 ('dept_manager',),
 ('dept_manager_dup',),
 ('emp_manager',),
 ('employees',),
 ('salaries',),
 ('titles',),
 ('v_manager_avg_salary',)]

## Connect the mysql server

In [6]:
import mysql.connector

conn = mysql.connector.connect(
    host='localhost',user='bhishan',passwd=pw,database='employees')

cur = conn.cursor()

In [7]:
%sql select * from dept_manager limit 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(110022, 'd001', datetime.date(1985, 1, 1), datetime.date(1991, 10, 1)),
 (110039, 'd001', datetime.date(1991, 10, 1), datetime.date(9999, 1, 1))]

## Avoid 1055 error

In [8]:
q = "set @@global.sql_mode := replace(@@global.sql_mode, 'ONLY_FULL_GROUP_BY', '');"
cur.execute(q)
conn.commit()

# CASE Statement

## Exercise 1:

Similar to the exercises done in the lecture, obtain a result set containing the employee number, first name, and last name of all employees with a number higher than 109990. Create a fourth column in the query, indicating whether this employee is also a manager, according to the data provided in the dept_manager table, or a regular employee.

In [10]:
%%sql
SELECT e.emp_no,
       e.first_name,
       e.last_name,
       CASE
           WHEN dm.emp_no IS NOT NULL THEN 'Manager'
           ELSE 'Employee'
       END AS is_manager
FROM employees e
LEFT JOIN dept_manager dm ON dm.emp_no = e.emp_no
WHERE e.emp_no > 109990
LIMIT 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(109991, 'Jinxi', 'Reistad', 'Employee'),
 (109992, 'Cheong', 'Heering', 'Employee')]

## Exercise 2:

Extract a dataset containing the following information about the managers: employee number, first name, and last name. Add two columns at the end – one showing the difference between the maximum and minimum salary of that employee, and another one saying whether this salary raise was higher than $30,000 or NOT.

In [11]:
%%sql
SELECT dm.emp_no,
       e.first_name,
       e.last_name,
       MAX(s.salary) - MIN(s.salary) AS salary_difference,
       CASE
           WHEN MAX(s.salary) - MIN(s.salary) > 30000 THEN 'Salary was raised by more then $30,000'
           ELSE 'Salary was NOT raised by more then $30,000'
       END AS salary_raise
FROM dept_manager dm
JOIN employees e ON e.emp_no = dm.emp_no
JOIN salaries s ON s.emp_no = dm.emp_no
GROUP BY s.emp_no;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
24 rows affected.

[(110022, 'Margareta', 'Markovitch', 37241, 'Salary was raised by more then $30,000'),
 (110039, 'Vishwani', 'Minakawa', 36550, 'Salary was raised by more then $30,000'),
 (110085, 'Ebru', 'Alpin', 28417, 'Salary was NOT raised by more then $30,000'),
 (110114, 'Isamu', 'Legleitner', 31387, 'Salary was raised by more then $30,000'),
 (110183, 'Shirish', 'Ossenbruggen', 30938, 'Salary was raised by more then $30,000'),
 (110228, 'Karsten', 'Sigstam', 25400, 'Salary was NOT raised by more then $30,000'),
 (110303, 'Krassimir', 'Wegerle', 30490, 'Salary was raised by more then $30,000'),
 (110344, 'Rosine', 'Cools', 24756, 'Salary was NOT raised by more then $30,000'),
 (110386, 'Shem', 'Kieras', 26995, 'Salary was NOT raised by more then $30,000'),
 (110420, 'Oscar', 'Ghazalie', 16654, 'Salary was NOT raised by more then $30,000'),
 (110511, 'DeForest', 'Hagimont', 25430, 'Salary was NOT raised by more then $30,000'),
 (110567, 'Leon', 'DasSarma', 34510, 'Salary was raised by more then $30,000'),
 (110725, 'Peternela', 'Onuegbe', 31836, 'Salary was raised by more then $30,000'),
 (110765, 'Rutger', 'Hofmeyr', 32377, 'Salary was raised by more then $30,000'),
 (110800, 'Sanjoy', 'Quadeer', 27169, 'Salary was NOT raised by more then $30,000'),
 (110854, 'Dung', 'Pesch', 27707, 'Salary was NOT raised by more then $30,000'),
 (111035, 'Przemyslawa', 'Kaelbling', 24261, 'Salary was NOT raised by more then $30,000'),
 (111133, 'Hauke', 'Zhang', 31200, 'Salary was raised by more then $30,000'),
 (111400, 'Arie', 'Staelin', 30798, 'Salary was raised by more then $30,000'),
 (111534, 'Hilary', 'Kambil', 31316, 'Salary was raised by more then $30,000'),
 (111692, 'Tonny', 'Butterworth', 33953, 'Salary was raised by more then $30,000'),
 (111784, 'Marjo', 'Giarratana', 18189, 'Salary was NOT raised by more then $30,000'),
 (111877, 'Xiaobin', 'Spinelli', 17560, 'Salary was NOT raised by more then $30,000'),
 (111939, 'Yuchang', 'Weedman', 18968, 'Salary was NOT raised by more then $30,000')]

In [12]:
%%sql
SELECT dm.emp_no,
       e.first_name,
       e.last_name,
       MAX(s.salary) - MIN(s.salary) AS salary_difference,
       IF(MAX(s.salary) - MIN(s.salary) > 30000, 'Salary was raised by more then $30,000', 'Salary was NOT raised by more then $30,000') AS salary_raise
FROM dept_manager dm
JOIN employees e ON e.emp_no = dm.emp_no
JOIN salaries s ON s.emp_no = dm.emp_no
GROUP BY s.emp_no;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
24 rows affected.

[(110022, 'Margareta', 'Markovitch', 37241, 'Salary was raised by more then $30,000'),
 (110039, 'Vishwani', 'Minakawa', 36550, 'Salary was raised by more then $30,000'),
 (110085, 'Ebru', 'Alpin', 28417, 'Salary was NOT raised by more then $30,000'),
 (110114, 'Isamu', 'Legleitner', 31387, 'Salary was raised by more then $30,000'),
 (110183, 'Shirish', 'Ossenbruggen', 30938, 'Salary was raised by more then $30,000'),
 (110228, 'Karsten', 'Sigstam', 25400, 'Salary was NOT raised by more then $30,000'),
 (110303, 'Krassimir', 'Wegerle', 30490, 'Salary was raised by more then $30,000'),
 (110344, 'Rosine', 'Cools', 24756, 'Salary was NOT raised by more then $30,000'),
 (110386, 'Shem', 'Kieras', 26995, 'Salary was NOT raised by more then $30,000'),
 (110420, 'Oscar', 'Ghazalie', 16654, 'Salary was NOT raised by more then $30,000'),
 (110511, 'DeForest', 'Hagimont', 25430, 'Salary was NOT raised by more then $30,000'),
 (110567, 'Leon', 'DasSarma', 34510, 'Salary was raised by more then $30,000'),
 (110725, 'Peternela', 'Onuegbe', 31836, 'Salary was raised by more then $30,000'),
 (110765, 'Rutger', 'Hofmeyr', 32377, 'Salary was raised by more then $30,000'),
 (110800, 'Sanjoy', 'Quadeer', 27169, 'Salary was NOT raised by more then $30,000'),
 (110854, 'Dung', 'Pesch', 27707, 'Salary was NOT raised by more then $30,000'),
 (111035, 'Przemyslawa', 'Kaelbling', 24261, 'Salary was NOT raised by more then $30,000'),
 (111133, 'Hauke', 'Zhang', 31200, 'Salary was raised by more then $30,000'),
 (111400, 'Arie', 'Staelin', 30798, 'Salary was raised by more then $30,000'),
 (111534, 'Hilary', 'Kambil', 31316, 'Salary was raised by more then $30,000'),
 (111692, 'Tonny', 'Butterworth', 33953, 'Salary was raised by more then $30,000'),
 (111784, 'Marjo', 'Giarratana', 18189, 'Salary was NOT raised by more then $30,000'),
 (111877, 'Xiaobin', 'Spinelli', 17560, 'Salary was NOT raised by more then $30,000'),
 (111939, 'Yuchang', 'Weedman', 18968, 'Salary was NOT raised by more then $30,000')]

## Exercie 3:

Extract the employee number, first name, and last name of the first 100 employees, and add a fourth column, called “current_employee” saying “Is still employed” if the employee is still working in the company, or “Not an employee anymore” if they aren’t.

In [14]:
%%sql
SELECT e.emp_no,
       e.first_name,
       e.last_name,
       CASE
           WHEN MAX(de.to_date) > SYSDATE() THEN 'Is still employed'
           ELSE 'Not an employee anymore'
       END AS current_employee
FROM employees e
JOIN dept_emp de ON de.emp_no = e.emp_no
GROUP BY de.emp_no
LIMIT 2;

 * mysql+mysqlconnector://bhishan:***@localhost/employees
2 rows affected.

[(10001, 'Georgi', 'Facello', 'Is still employed'),
 (10002, 'Bezalel', 'Simmel', 'Is still employed')]